package com.amber.insect.jvm;

/**
 * @ClassName Doc
 * @Description TODO
 * @Author amber.liyuze
 * @Date 2021/11/25 21:29
 * @Version 1.0
 **/
public class Doc {

    /**
     *
     *
     *
     *   1. 有关补码，简要阐述补码的好处。并计算给出 -99, -105, 205 整数的补码
     * 2. 有关浮点数，根据IEEE745，计算11000001000100000000000000000000的单精度浮点的值，并给出计算过程。
     * 3.写一个Java程序，将100.2转成IEEE745 二进制表示 ，给出程序和结果。
     *
     *
     *
     *
     *
     * 1. 写一个程序，让程序在运行之后，最终抛出由于Perm区溢出引起的OOM，给出运行的jdk版本，程序源码，运行参数，以及系统溢出后的截图、程序所依赖的jar包说明，并说明你的基本思路
     * 2.你能想到有什么办法，可以让一个程序的函数调用层次变的更深。比如，你在一个递归调用中，发生了stack的溢出，你可以做哪些方面的尝试，使系统尽量不溢出？阐述你的观点和原因。
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     */







    public static void main(String[] args) {

    }




}
